hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
static void spiWr16_slow(uint16_t reg, uint16_t val) {
    spiBegin();
    int hz = slac::spi_slow_hz();
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
    spiTransfer16(cmd16(false, true, reg), hz);
    spiTransfer16(val, hz);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    spiEnd();
}

static bool hardReset() {
    gpio_set_direction(static_cast<gpio_num_t>(g_rst), GPIO_MODE_OUTPUT);
    gpio_set_level(static_cast<gpio_num_t>(g_rst), 0);
    slac_delay(slac::hardreset_low_ms());
    gpio_set_level(static_cast<gpio_num_t>(g_rst), 1);
    slac_delay(slac::hardreset_high_ms());
    // Wait 200 ms (datasheet recommends 200–500 ms) before probing the modem
    slac_delay(200);

    auto slowRd16 = [&](uint16_t reg) -> uint16_t {
        spiBegin();
        int hz = slac::spi_slow_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        spiTransfer16(cmd16(true, true, reg), hz);
        uint16_t v = spiTransfer16(0, hz);
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();
        return v;
    };

    (void)slowRd16(SPI_REG_SIGNATURE); // dummy read as recommended

    uint32_t t0 = slac_millis();
    uint16_t sig = 0, buf = 0;
    do {
        sig = slowRd16(SPI_REG_SIGNATURE);
        buf = slowRd16(SPI_REG_WRBUF_SPC_AVA);
        if (sig == SIG && buf == WRBUF_RST)
            break;
        slac_delay(5);
    } while (slac_millis() - t0 < 200);

    if (sig != SIG || buf != WRBUF_RST) {
        ESP_LOGE(PLC_TAG, "Reset probe failed (SIG=0x%04X BUF=0x%04X)", sig, buf);
        return false;
    }
    ESP_LOGI(PLC_TAG, "Reset probe OK (SIG=0x%04X)", sig);

    t0 = slac_millis();
    while (!(slowRd16(SPI_REG_INTR_CAUSE) & SPI_INT_CPU_ON) &&
           slac_millis() - t0 < slac::cpuon_timeout_ms())
        ;
    if (!(slowRd16(SPI_REG_INTR_CAUSE) & SPI_INT_CPU_ON)) {
        ESP_LOGE(PLC_TAG, "CPU_ON not asserted after hard reset");
        return false;
    }

    uint16_t cfg = slowRd16(SPI_REG_SPI_CONFIG);
    if (cfg & QCASPI_MULTI_CS_BIT)
        spiWr16_slow(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);

    spiWr16_slow(SPI_REG_INTR_CAUSE, 0xFFFF);
    // Read signature twice before enabling interrupts as recommended by
    // the datasheet to ensure the modem is ready to accept new commands.
    (void)slowRd16(SPI_REG_SIGNATURE);
    (void)slowRd16(SPI_REG_SIGNATURE);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
    return true;
}

static bool softReset() {
    auto slowRd16 = [&](uint16_t reg) -> uint16_t {
        spiBegin();
        int hz = slac::spi_slow_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        spiTransfer16(cmd16(true, true, reg), hz);
        uint16_t v = spiTransfer16(0, hz);
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();
        return v;
    };
    auto slowWr16 = [&](uint16_t reg, uint16_t val) {
        spiBegin();
        int hz = slac::spi_slow_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        spiTransfer16(cmd16(false, true, reg), hz);
        spiTransfer16(val, hz);
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();
    };

    uint16_t cfg = slowRd16(SPI_REG_SPI_CONFIG);
    slowWr16(SPI_REG_SPI_CONFIG, cfg | QCASPI_SLAVE_RESET_BIT);
    slac_delay(10);

    (void)slowRd16(SPI_REG_SIGNATURE); // dummy read

    uint32_t t0 = slac_millis();
    uint16_t sig = 0, buf = 0;
    do {
        sig = slowRd16(SPI_REG_SIGNATURE);
        buf = slowRd16(SPI_REG_WRBUF_SPC_AVA);
        if (sig == SIG && buf == WRBUF_RST)
            break;
        slac_delay(5);
    } while (slac_millis() - t0 < 200);

    if (sig != SIG || buf != WRBUF_RST)
        return false;

    t0 = slac_millis();
    while (!(slowRd16(SPI_REG_INTR_CAUSE) & SPI_INT_CPU_ON) &&
           slac_millis() - t0 < 80)
        ;
    if (!(slowRd16(SPI_REG_INTR_CAUSE) & SPI_INT_CPU_ON)) {
        ESP_LOGE(PLC_TAG, "CPU_ON not asserted after soft reset");
        return false;
    }
    cfg = slowRd16(SPI_REG_SPI_CONFIG);
    if (cfg & QCASPI_MULTI_CS_BIT)
        slowWr16(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);

    spiWr16_slow(SPI_REG_INTR_CAUSE, 0xFFFF);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
    return true;
}

static void initialSetup() {
    (void)spiRd16_slow(SPI_REG_SIGNATURE);
    uint32_t t0 = slac_millis();
    uint16_t sig = 0;
    do {
        sig = spiRd16_slow(SPI_REG_SIGNATURE);
        if (sig == SIG)
            break;
        slac_delay(5);
    } while (slac_millis() - t0 < 200);
    uint16_t cfg = spiRd16_slow(SPI_REG_SPI_CONFIG);
    if (cfg & QCASPI_MULTI_CS_BIT)
        spiWr16_slow(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);
    spiWr16_slow(SPI_REG_INTR_CAUSE, 0xFFFF);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
}

uint16_t qca7000ReadInternalReg(uint16_t r) {
    return spiRd16_slow(r);
}
bool qca7000ReadSignature(uint16_t* s, uint16_t* v) {
    uint16_t sig = qca7000ReadInternalReg(SPI_REG_SIGNATURE), ver = qca7000ReadInternalReg(0x1B00);
    if (s)
        *s = sig;
    if (v)
        *v = ver;
    return sig == SIG;
}

bool qca7000CheckAlive() {
    uint16_t sig = qca7000ReadInternalReg(SPI_REG_SIGNATURE);
    (void)qca7000ReadInternalReg(SPI_REG_WRBUF_SPC_AVA);
    uint16_t cause = qca7000ReadInternalReg(SPI_REG_INTR_CAUSE);
    return sig == SIG && (cause & SPI_INT_CPU_ON);
}

static bool read_region_code(qca7000_region* region) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::qualcomm::op_attr_req req;
    } req_msg{};

    memset(&req_msg, 0, sizeof(req_msg));
    memset(req_msg.eth.ether_dhost, 0xFF, ETH_ALEN);
    memcpy(req_msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    req_msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    req_msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    req_msg.hp.mmtype =
        slac::htole16(slac::defs::qualcomm::MMTYPE_OP_ATTR |
                      slac::defs::MMTYPE_MODE_REQ);

    if (!txFrame(reinterpret_cast<uint8_t*>(&req_msg), sizeof(req_msg)))
        return false;

    uint32_t start = slac_millis();
    uint8_t buf[V2GTP_BUFFER_SIZE];
    while (slac_millis() - start < 100) {
        qca7000ProcessSlice(1000);
        size_t got = spiQCA7000checkForReceivedData(buf, sizeof(buf));
        if (!got)
            continue;
        if (got < sizeof(ether_header) + 3)
            continue;
        const ether_header* eth = reinterpret_cast<const ether_header*>(buf);
        if (eth->ether_type != slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY))
            continue;
        const uint8_t* p = buf + sizeof(ether_header);
        uint8_t mmv = p[0];
        uint16_t mmtype = slac::le16toh(*reinterpret_cast<const uint16_t*>(p + 1));
        if (mmv != static_cast<uint8_t>(slac::defs::MMV::AV_1_0))
            continue;
        if (mmtype == (slac::defs::qualcomm::MMTYPE_OP_ATTR |
                        slac::defs::MMTYPE_MODE_CNF)) {
            const auto* cnf =
                reinterpret_cast<const slac::messages::qualcomm::op_attr_cnf*>(p + 3);
            if (cnf->success == 0) {
                *region = (cnf->line_freq_zc == 0x01) ? qca7000_region::NA
                                                     : qca7000_region::EU;
                return true;
            }
        }
    }
    return false;
}

