hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
#ifdef LIBSLAC_TESTING
bool txFrame(const uint8_t* eth, size_t ethLen) {
#else
static bool txFrame(const uint8_t* eth, size_t ethLen) {
#endif
    if (ethLen > 1522)
        return false;
    size_t frameLen = ethLen;
    if (frameLen < 60)
        frameLen = 60;
    uint16_t spiLen = TX_HDR + frameLen + FTR_LEN;
    if (spiRd16_slow(SPI_REG_WRBUF_SPC_AVA) < spiLen)
        return false;

    spiWr16_slow(SPI_REG_BFR_SIZE, spiLen);

    spiBegin();
    int hz = slac::spi_fast_hz();
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
    spiTransfer16(cmd16(false, false, 0), hz);
    spiTransfer16(SOF_WORD, hz);
    spiTransfer16(SOF_WORD, hz);
    spiTransfer16(slac::htole16(static_cast<uint16_t>(frameLen)), hz);
    spiTransfer16(0, hz);
    if (ethLen) {
        size_t off = 0;
        while (off < ethLen) {
            size_t chunk = ethLen - off;
            if (chunk > slac::spi_burst_len())
                chunk = slac::spi_burst_len();
            spiWriteBytes(eth + off, chunk, hz);
            off += chunk;
        }
    }
    if (frameLen > ethLen) {
        uint8_t pad[60]{};
        size_t padLen = frameLen - ethLen;
        size_t off = 0;
        while (off < padLen) {
            size_t chunk = padLen - off;
            if (chunk > slac::spi_burst_len())
                chunk = slac::spi_burst_len();
            spiWriteBytes(pad, chunk, hz);
            off += chunk;
        }
    }
    spiTransfer16(EOF_WORD, hz);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    spiEnd();
    return true;
}

static void handleRxError(const char* reason) {
    ESP_LOGW(PLC_TAG, "RX error: %s - resetting", reason);
    spiWr16_slow(SPI_REG_INTR_ENABLE, 0);
    bool ok = qca7000SoftReset();
    uint16_t cfg = spiRd16_slow(SPI_REG_SPI_CONFIG);
    if (cfg & QCASPI_MULTI_CS_BIT) {
        ESP_LOGW(PLC_TAG, "Clearing MULTI_CS bit after reset");
        spiWr16_slow(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);
    }
    if (!ok) {
        ESP_LOGW(PLC_TAG, "Soft reset failed - performing hard reset");
        ok = hardReset();
    }
    if (!ok) {
        ESP_LOGE(PLC_TAG, "Hard reset failed");
        g_driver_fatal = true;
        if (g_err_cb.flag)
            *g_err_cb.flag = true;
        if (g_err_cb.cb)
            g_err_cb.cb(Qca7000ErrorStatus::DriverFatal, g_err_cb.arg);
        return;
    }
    head.store(0, std::memory_order_relaxed);
    tail.store(0, std::memory_order_relaxed);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
    if (g_err_cb.cb)
        g_err_cb.cb(Qca7000ErrorStatus::Reset, g_err_cb.arg);
}
#ifdef LIBSLAC_TESTING
void fetchRx() {
#else
static void fetchRx() {
#endif
    while (true) {
        uint16_t avail = spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA);
        if (avail < RX_HDR + FTR_LEN || avail > V2GTP_BUFFER_SIZE)
            break;

        uint16_t requested = avail;
        spiWr16_slow(SPI_REG_BFR_SIZE, requested);

        static uint8_t buf[V2GTP_BUFFER_SIZE];
        spiBegin();
        int hz = slac::spi_fast_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        uint16_t first = spiTransfer16(cmd16(true, false, 0), hz);
        buf[0] = first & 0xFF;
        buf[1] = first >> 8;
        for (uint16_t i = 0; i < requested - 2; ++i)
            buf[i + 2] = spiTransfer(0, hz);
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();

        const uint8_t* p = buf;
        uint16_t remaining = requested;
        while (remaining >= RX_HDR + FTR_LEN) {
            uint32_t len = (uint32_t)p[0] | ((uint32_t)p[1] << 8) |
                            ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
            if (memcmp(p + 4, "\xAA\xAA\xAA\xAA", 4) != 0) {
                handleRxError("bad SOF");
                remaining = 0;
                break;
            }

            uint16_t fl = slac::le16toh(static_cast<uint16_t>((p[9] << 8) | p[8]));
            uint16_t frame_total = RX_HDR + fl + FTR_LEN;
            if (len != frame_total && len + 4 != frame_total) {
                ESP_LOGE(PLC_TAG,
                         "RX len mismatch: req=%" PRIu32 " got=%" PRIu32,
                         static_cast<uint32_t>(frame_total), len);
                handleRxError("length mismatch");
                remaining = 0;
                break;
            }

            if (frame_total > remaining) {
                handleRxError("invalid FL");
                remaining = 0;
                break;
            }
            if (p[RX_HDR + fl] != 0x55 || p[RX_HDR + fl + 1] != 0x55) {
                handleRxError("bad EOF");
                remaining = 0;
                break;
            }

            ringPush(p + RX_HDR, fl);

            p += frame_total;
            remaining -= frame_total;
        }
    }
}

bool spiQCA7000SendEthFrame(const uint8_t* f, size_t l) {
    bool ok = txFrame(f, l);
    if (ok && l <= V2GTP_BUFFER_SIZE) {
        memcpy(myethtransmitbuffer, f, l);
        myethtransmitlen = l;
    }
    return ok;
}
size_t spiQCA7000checkForReceivedData(uint8_t* d, size_t m) {
    fetchRx();
    const uint8_t* s;
    size_t l;
    if (!ringPop(&s, &l))
        return 0;
    size_t c = l > m ? m : l;
    memcpy(d, s, c);
    size_t store = l;
    if (l > V2GTP_BUFFER_SIZE) {
        ESP_LOGW(PLC_TAG, "RX frame larger than buffer (%zu > %d) - truncating", l, V2GTP_BUFFER_SIZE);
        store = V2GTP_BUFFER_SIZE;
    }
    memcpy(myethreceivebuffer, s, store);
    myethreceivelen = store;
    return c;
}

static uint8_t g_src_mac[ETH_ALEN] = {0x02, 0x00, 0x00, 0x00, 0x00, 0x01};

void qca7000SetMac(const uint8_t mac[ETH_ALEN]) {
    if (mac)
        memcpy(g_src_mac, mac, ETH_ALEN);
}

const uint8_t* qca7000GetMac() {
    return g_src_mac;
}

const uint8_t* qca7000GetMatchedMac() {
    return g_slac_ctx.matched_mac;
}

qca7000_region qca7000GetRegion() {
    return g_region;
}

static bool send_cm_set_key_req_local(const uint8_t nmk[slac::defs::NMK_LEN],
                                      const uint8_t nid[slac::defs::NID_LEN]) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_set_key_req req;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memset(msg.eth.ether_dhost, 0xFF, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype =
        slac::htole16(slac::defs::MMTYPE_CM_SET_KEY | slac::defs::MMTYPE_MODE_REQ);
    msg.req.key_type = slac::defs::CM_SET_KEY_REQ_KEY_TYPE_NMK;
    msg.req.my_nonce = 0;
    msg.req.your_nonce = 0;
    msg.req.pid = slac::defs::CM_SET_KEY_REQ_PID_HLE;
    msg.req.prn = slac::htole16(slac::defs::CM_SET_KEY_REQ_PRN_UNUSED);
    msg.req.pmn = slac::defs::CM_SET_KEY_REQ_PMN_UNUSED;
    msg.req.cco_capability = slac::defs::CM_SET_KEY_REQ_CCO_CAP_NONE;
    memcpy(msg.req.nid, nid, sizeof(msg.req.nid));
    msg.req.new_eks = slac::defs::CM_SET_KEY_REQ_PEKS_NMK_KNOWN_TO_STA;
    memcpy(msg.req.new_key, nmk, slac::defs::NMK_LEN);

    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg));
}

static bool send_start_atten_char(const SlacContext& ctx);
static bool send_mnbc_sound(const SlacContext& ctx, uint8_t remaining);
static bool send_atten_char_rsp(const SlacContext& ctx, const uint8_t* dst,
                                const slac::messages::cm_atten_char_ind* ind);
static bool send_set_key_cnf(const SlacContext& ctx, const uint8_t* dst, const slac::messages::cm_set_key_req* req);
static bool send_parm_req(const SlacContext& ctx);
static bool send_parm_cnf(const SlacContext& ctx, const uint8_t* dst,
                          const slac::messages::cm_slac_parm_req& req);
static bool send_parm_cnf(const SlacContext& ctx, const uint8_t* dst,
                          const slac::messages::cm_slac_parm_req& req);

