hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
    if (g_slac_ctx.validate_count == 1) {
        if (slac::validation_disabled()) {
            msg.cnf.result = 0x04;
            g_slac_ctx.validate_success = true;
        } else {
            bool ok = qca7000CheckBcbToggle();
            msg.cnf.toggle_num = ok ? 1 : 0;
            msg.cnf.result = ok ? 0x02 : 0x03;
            g_slac_ctx.validate_success = ok;
        }
    }

    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg));
}

static bool send_match_cnf(const SlacContext& ctx) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_slac_match_cnf cnf;
    } msg{};

    // Generate a fresh NMK and corresponding NID for this session
#ifdef ESP_PLATFORM
    esp_fill_random(g_evse_nmk, sizeof(g_evse_nmk));
#else
    for (auto& b : g_evse_nmk)
        b = static_cast<uint8_t>(esp_random() & 0xFF);
#endif
    slac::utils::generate_nid_from_nmk(
        g_evse_nid, g_evse_nmk,
        slac::defs::NID_SECURITY_LEVEL_SIMPLE_CONNECT);

    memset(&msg, 0, sizeof(msg));
    memcpy(msg.eth.ether_dhost, ctx.match_src_mac, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_SLAC_MATCH | slac::defs::MMTYPE_MODE_CNF);
    msg.cnf.application_type = ctx.match_req.application_type;
    msg.cnf.security_type = ctx.match_req.security_type;
    msg.cnf.mvf_length = slac::htole16(slac::defs::CM_SLAC_MATCH_CNF_MVF_LENGTH);
    memcpy(msg.cnf.pev_id, ctx.match_req.pev_id, sizeof(msg.cnf.pev_id));
    memcpy(msg.cnf.pev_mac, ctx.match_req.pev_mac, sizeof(msg.cnf.pev_mac));
    memcpy(msg.cnf.evse_id, ctx.match_req.evse_id, sizeof(msg.cnf.evse_id));
    memcpy(msg.cnf.evse_mac, ctx.match_req.evse_mac, sizeof(msg.cnf.evse_mac));
    memcpy(msg.cnf.run_id, ctx.match_req.run_id, sizeof(msg.cnf.run_id));
    memcpy(msg.cnf.nid, g_evse_nid, sizeof(msg.cnf.nid));
    memcpy(msg.cnf.nmk, g_evse_nmk, sizeof(msg.cnf.nmk));

    bool ok = txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg));
    if (ok)
        qca7000SetNmk(g_evse_nmk);

    slac::MatchLogInfo info{};
    memcpy(info.pev_mac, ctx.match_req.pev_mac, ETH_ALEN);
    memcpy(info.evse_mac, ctx.match_req.evse_mac, ETH_ALEN);
    memcpy(info.nmk, g_evse_nmk, sizeof(info.nmk));

    uint8_t min = 0xFF, max = 0, sum = 0;
    for (uint8_t i = 0; i < ctx.num_groups && i < slac::defs::AAG_LIST_LEN; ++i) {
        uint8_t v = ctx.atten_sum[i] / slac::defs::C_EV_MATCH_MNBC;
        if (v < min)
            min = v;
        if (v > max)
            max = v;
        sum += v;
    }
    info.tone_min = (ctx.num_groups ? min : 0);
    info.tone_max = (ctx.num_groups ? max : 0);
    info.tone_avg = (ctx.num_groups ? (sum / ctx.num_groups) : 0);
    info.cp_state = slac::slac_get_cp_state();

    slac::slac_log_match(info);

  return ok;
}

// Handle SLAC messages polled by the application
void qca7000HandleSlacParmReq(slac::messages::HomeplugMessage& msg) {
    const auto& req = msg.get_payload<slac::messages::cm_slac_parm_req>();
    uint8_t expected_app =
        (g_region == qca7000_region::NA) ? 0x01 : slac::defs::COMMON_APPLICATION_TYPE;
    if (req.application_type != expected_app ||
        req.security_type != slac::defs::COMMON_SECURITY_TYPE) {
        ESP_LOGW(PLC_TAG, "Invalid CM_SLAC_PARM.REQ app/security %u/%u",
                 req.application_type, req.security_type);
        return;
    }
    bool duplicate =
        memcmp(req.run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id)) == 0;
    memcpy(g_slac_ctx.run_id, req.run_id, sizeof(g_slac_ctx.run_id));
    memcpy(g_slac_ctx.pev_mac, msg.get_src_mac(), ETH_ALEN);
    g_slac_ctx.timer = slac_millis();
    g_slac_ctx.retry_count = slac::defs::C_EV_MATCH_RETRY;
    g_slac_ctx.sound_sent = 0;
    g_slac_ctx.validate_count = 0;
    g_slac_ctx.atten_count = 0;
    memset(g_slac_ctx.atten_sum, 0, sizeof(g_slac_ctx.atten_sum));
    g_slac_ctx.num_groups = 0;
    memset(&g_slac_ctx.match_req, 0, sizeof(g_slac_ctx.match_req));
    memset(g_slac_ctx.match_src_mac, 0, ETH_ALEN);
    memset(g_slac_ctx.matched_mac, 0, ETH_ALEN);
    g_slac_ctx.filter_active = false;
    g_slac_ctx.validate_success = false;

    if (duplicate)
        ESP_LOGI(PLC_TAG, "Restarting SLAC after duplicate CM_SLAC_PARM.REQ");

    send_parm_cnf(g_slac_ctx, msg.get_src_mac(), req);
    send_start_atten_char(g_slac_ctx);
    g_slac_ctx.timer = slac_millis();
    g_fsm.reset<SoundingState>(g_slac_ctx);
}

void qca7000HandleSlacParmCnf(slac::messages::HomeplugMessage& msg) {
    const auto& cnf = msg.get_payload<slac::messages::cm_slac_parm_cnf>();
    if (memcmp(cnf.run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id)) == 0) {
        g_fsm.handle_event(slac::SlacEvent::GotParmCnf);
    } else {
        ESP_LOGW(PLC_TAG, "CM_SLAC_PARM.CNF run_id mismatch");
        g_fsm.handle_event(slac::SlacEvent::Error);
    }
}

void qca7000HandleStartAttenCharInd(slac::messages::HomeplugMessage&) {
    ESP_LOGW(PLC_TAG, "Unexpected CM_START_ATTEN_CHAR.IND");
}

void qca7000HandleAttenProfileInd(slac::messages::HomeplugMessage& msg) {
    const auto& prof = msg.get_payload<slac::messages::cm_atten_profile_ind>();
    uint8_t* src = msg.get_src_mac();
    if (memcmp(src, g_slac_ctx.pev_mac, ETH_ALEN) != 0 ||
        memcmp(prof.pev_mac, g_slac_ctx.pev_mac, ETH_ALEN) != 0)
        return;
    if (g_slac_ctx.atten_count == 0) {
        memset(g_slac_ctx.atten_sum, 0, sizeof(g_slac_ctx.atten_sum));
        g_slac_ctx.num_groups = prof.num_groups;
        g_slac_ctx.timer = slac_millis();
    }
    for (uint8_t i = 0; i < prof.num_groups && i < slac::defs::AAG_LIST_LEN; ++i) {
        g_slac_ctx.atten_sum[i] += prof.aag[i];
    }
    ++g_slac_ctx.atten_count;
    uint32_t now = slac_millis();
    if (now - g_slac_ctx.timer >= slac::defs::TT_EVSE_MATCH_MNBC_MS ||
        g_slac_ctx.atten_count >= slac::defs::C_EV_MATCH_MNBC) {
        send_atten_char_ind(g_slac_ctx);
        g_slac_ctx.atten_count = 0;
        g_slac_ctx.timer = 0;
    }
}

void qca7000HandleAttenCharInd(slac::messages::HomeplugMessage& msg) {
    const auto& ind = msg.get_payload<slac::messages::cm_atten_char_ind>();
    uint8_t* src = msg.get_src_mac();
    if (memcmp(ind.run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id)) == 0) {
        send_atten_char_rsp(g_slac_ctx, src, &ind);
        g_fsm.handle_event(slac::SlacEvent::GotAttenCharInd);
    } else {
        ESP_LOGW(PLC_TAG, "CM_ATTEN_CHAR.IND run_id mismatch");
        g_fsm.handle_event(slac::SlacEvent::Error);
    }
}

void qca7000HandleSetKeyReq(slac::messages::HomeplugMessage& msg) {
    const auto& req = msg.get_payload<slac::messages::cm_set_key_req>();
    send_set_key_cnf(g_slac_ctx, msg.get_src_mac(), &req);
    g_fsm.handle_event(slac::SlacEvent::GotSetKeyReq);
}

void qca7000HandleValidateReq(slac::messages::HomeplugMessage& msg) {
    const auto& req = msg.get_payload<slac::messages::cm_validate_req>();
    send_validate_cnf(msg.get_src_mac(), &req);
    if (req.result == slac::defs::CM_VALIDATE_REQ_RESULT_FAILURE) {
        clear_slac_state();
        g_fsm.handle_event(slac::SlacEvent::ValidateFailed);
    } else {
        g_fsm.handle_event(slac::SlacEvent::GotValidateReq);
    }
}

