hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
void qca7000HandleSlacMatchReq(slac::messages::HomeplugMessage& msg) {
    const auto& req = msg.get_payload<slac::messages::cm_slac_match_req>();
    if (memcmp(req.run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id)) == 0) {
        memcpy(&g_slac_ctx.match_req, &req, sizeof(g_slac_ctx.match_req));
        memcpy(g_slac_ctx.match_src_mac, msg.get_src_mac(), ETH_ALEN);
        g_fsm.handle_event(slac::SlacEvent::GotMatchReq);
    } else {
        ESP_LOGW(PLC_TAG, "CM_SLAC_MATCH.REQ run_id mismatch");
        g_fsm.handle_event(slac::SlacEvent::Error);
    }
}

// FSM state implementations
struct SoundingState;
struct WaitSetKeyState;
struct WaitValidateState;
struct WaitMatchState;
struct IdleState : public FSM::SimpleStateType {
    SlacContext& ctx;
    IdleState(SlacContext& c) : ctx(c) {
    }
    void enter() override {
        ctx.result = SlacState::Idle;
    }
    fsm::states::HandleEventResult handle_event(FSM::StateAllocatorType&, slac::SlacEvent) override {
        return FSM::StateAllocatorType::PASS_ON;
    }
};

struct WaitParmCnfState : public FSM::SimpleStateType {
    SlacContext& ctx;
    WaitParmCnfState(SlacContext& c) : ctx(c) {
    }
    void enter() override {
        ctx.result = SlacState::WaitParmCnf;
        ctx.sound_sent = 0;
        ctx.timer = slac_millis();
    }
    fsm::states::HandleEventResult handle_event(FSM::StateAllocatorType& alloc, slac::SlacEvent ev) override {
        if (ev == slac::SlacEvent::GotParmCnf) {
            send_start_atten_char(ctx);
            ctx.timer = slac_millis();
            ctx.result = SlacState::Sounding;
            return alloc.create_simple<SoundingState>(ctx);
        }
        if (ev == slac::SlacEvent::ValidateFailed || ev == slac::SlacEvent::Timeout ||
            ev == slac::SlacEvent::Error) {
            if (ctx.retry_count > 0) {
                --ctx.retry_count;
                qca7000ToggleCpEf();
                send_parm_req(ctx);
                ctx.timer = slac_millis();
                return FSM::StateAllocatorType::HANDLED_INTERNALLY;
            }
            ctx.result = SlacState::Failed;
            return alloc.create_simple<IdleState>(ctx);
        }
        return FSM::StateAllocatorType::PASS_ON;
    }
};

struct SoundingState : public FSM::SimpleStateType {
    SlacContext& ctx;
    SoundingState(SlacContext& c) : ctx(c) {
    }
    void enter() override {
        ctx.result = SlacState::Sounding;
    }
    fsm::states::HandleEventResult handle_event(FSM::StateAllocatorType& alloc, slac::SlacEvent ev) override {
        if (ev == slac::SlacEvent::SoundIntervalElapsed) {
            uint8_t remaining = slac::defs::C_EV_MATCH_MNBC - ctx.sound_sent - 1;
            send_mnbc_sound(ctx, remaining);
            ++ctx.sound_sent;
            return FSM::StateAllocatorType::HANDLED_INTERNALLY;
        }
        if (ev == slac::SlacEvent::GotAttenCharInd) {
            ctx.timer = slac_millis();
            ctx.result = SlacState::WaitSetKey;
            return alloc.create_simple<WaitSetKeyState>(ctx);
        }
        if (ev == slac::SlacEvent::ValidateFailed || ev == slac::SlacEvent::Timeout ||
            ev == slac::SlacEvent::Error) {
            ctx.result = SlacState::Failed;
            return alloc.create_simple<IdleState>(ctx);
        }
        return FSM::StateAllocatorType::PASS_ON;
    }
};

struct WaitSetKeyState : public FSM::SimpleStateType {
    SlacContext& ctx;
    WaitSetKeyState(SlacContext& c) : ctx(c) {
    }
    void enter() override {
        ctx.result = SlacState::WaitSetKey;
        ctx.timer = slac_millis();
    }
    fsm::states::HandleEventResult handle_event(FSM::StateAllocatorType& alloc, slac::SlacEvent ev) override {
        if (ev == slac::SlacEvent::GotSetKeyReq) {
            ctx.timer = slac_millis();
            ctx.validate_count = 0;
            ctx.result = SlacState::WaitValidate;
            return alloc.create_simple<WaitValidateState>(ctx);
        }
        if (ev == slac::SlacEvent::ValidateFailed || ev == slac::SlacEvent::Timeout ||
            ev == slac::SlacEvent::Error) {
            ctx.result = SlacState::Failed;
            return alloc.create_simple<IdleState>(ctx);
        }
        return FSM::StateAllocatorType::PASS_ON;
    }
};

struct WaitValidateState : public FSM::SimpleStateType {
    SlacContext& ctx;
    WaitValidateState(SlacContext& c) : ctx(c) {
    }
    void enter() override {
        ctx.result = SlacState::WaitValidate;
        ctx.timer = slac_millis();
    }
    fsm::states::HandleEventResult handle_event(FSM::StateAllocatorType& alloc, slac::SlacEvent ev) override {
        if (ev == slac::SlacEvent::GotValidateReq) {
            ctx.timer = slac_millis();
            if (++ctx.validate_count >= 2) {
                if (slac::validation_disabled() || ctx.validate_success) {
                    ctx.result = SlacState::WaitMatch;
                    return alloc.create_simple<WaitMatchState>(ctx);
                }
                ctx.result = SlacState::Failed;
                return alloc.create_simple<IdleState>(ctx);
            }
            return FSM::StateAllocatorType::HANDLED_INTERNALLY;
        }
        if (ev == slac::SlacEvent::ValidateFailed) {
            ctx.result = SlacState::Failed;
            return alloc.create_simple<IdleState>(ctx);
        }
        if (ev == slac::SlacEvent::Timeout || ev == slac::SlacEvent::Error) {
            ctx.result = SlacState::Failed;
            return alloc.create_simple<IdleState>(ctx);
        }
        return FSM::StateAllocatorType::PASS_ON;
    }
};

struct WaitMatchState : public FSM::SimpleStateType {
    SlacContext& ctx;
    WaitMatchState(SlacContext& c) : ctx(c) {
    }
    void enter() override {
        ctx.result = SlacState::WaitMatch;
        ctx.timer = slac_millis();
    }
    fsm::states::HandleEventResult handle_event(FSM::StateAllocatorType& alloc, slac::SlacEvent ev) override {
        if (ev == slac::SlacEvent::GotMatchReq) {
            send_match_cnf(ctx);
            memcpy(ctx.matched_mac, ctx.match_src_mac, ETH_ALEN);
            ctx.filter_active = true;
            ctx.result = SlacState::Matched;
            return alloc.create_simple<IdleState>(ctx);
        }
        if (ev == slac::SlacEvent::ValidateFailed || ev == slac::SlacEvent::Timeout ||
            ev == slac::SlacEvent::Error) {
            ctx.result = SlacState::Failed;
            return alloc.create_simple<IdleState>(ctx);
        }
        return FSM::StateAllocatorType::PASS_ON;
    }
};

// Issue a CM_SLAC_PARM.REQ to start the SLAC matching handshake.
bool qca7000startSlac() {
    g_slac_ctx.result = SlacState::WaitParmCnf;
    g_slac_ctx.timer = slac_millis();
    g_slac_ctx.retry_count = slac::defs::C_EV_MATCH_RETRY;
    g_slac_ctx.sound_sent = 0;
    g_slac_ctx.validate_count = 0;
    g_slac_ctx.atten_count = 0;
    memset(g_slac_ctx.atten_sum, 0, sizeof(g_slac_ctx.atten_sum));
    g_slac_ctx.num_groups = 0;
    memset(&g_slac_ctx.match_req, 0, sizeof(g_slac_ctx.match_req));
    memset(g_slac_ctx.match_src_mac, 0, sizeof(g_slac_ctx.match_src_mac));
    memset(g_slac_ctx.matched_mac, 0, sizeof(g_slac_ctx.matched_mac));
    g_slac_ctx.filter_active = false;
    g_slac_ctx.validate_success = false;

    for (size_t i = 0; i < sizeof(g_slac_ctx.run_id); ++i)
        g_slac_ctx.run_id[i] = static_cast<uint8_t>(esp_random() & 0xFF);

