hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
static void process_cause(uint16_t cause) {
    if (cause & SPI_INT_CPU_ON) {
        initialSetup();
        if (g_err_cb.cb)
            g_err_cb.cb(Qca7000ErrorStatus::Reset, g_err_cb.arg);
    }

    if (cause & (SPI_INT_WRBUF_ERR | SPI_INT_RDBUF_ERR)) {
        bool ok = hardReset();
        if (!ok) {
            ESP_LOGE(PLC_TAG, "Hard reset failed after buffer error");
            if (++g_crash_count >= 3 && g_pwr >= 0) {
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
                slac_delay(200);
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
                slac_delay(200);
                g_crash_count = 0;
            }
            g_driver_fatal = true;
        } else {
            g_crash_count = 0;
            qca7000startSlac();
        }
        bool fatal = !ok;
        uint32_t now = slac_millis();
        if (now - g_buferr_ts <= 1000)
            ++g_buferr_count;
        else
            g_buferr_count = 1;
        g_buferr_ts = now;
        if (g_buferr_count >= 3) {
            if (g_pwr >= 0) {
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
                slac_delay(200);
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
                slac_delay(200);
            }
            g_driver_fatal = true;
            fatal = true;
            g_buferr_count = 0;
        }
        if (g_err_cb.flag)
            *g_err_cb.flag = fatal || g_driver_fatal;
        if (g_err_cb.cb)
            g_err_cb.cb((fatal || g_driver_fatal) ?
                            Qca7000ErrorStatus::DriverFatal :
                            Qca7000ErrorStatus::Reset,
                        g_err_cb.arg);
    }

    if (cause & SPI_INT_PKT_AVLBL) {
        size_t loops = 0;
        while (spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA) > 0) {
            fetchRx();
            if (++loops >= slac::spi_burst_len())
                break;
            if (spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA) == 0)
                break;
        }
    }

    spiWr16_slow(SPI_REG_INTR_CAUSE, cause);
}

void qca7000ProcessSlice(uint32_t max_us) {
    if (g_sleeping)
        return;
    uint32_t t0 = get_us();
    uint16_t loops = 0;

    spiWr16_slow(SPI_REG_INTR_ENABLE, 0);
    while (true) {
        uint16_t cause = spiRd16_slow(SPI_REG_INTR_CAUSE);
        if (!cause)
            break;

        process_cause(cause);
        if (++loops > 32)
            break;
        if (get_us() - t0 > max_us)
            break;
    }
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
}

void qca7000Process() {
    if (g_sleeping)
        return;
    if (qca7000CheckBcbToggle())
        qca7000Wake();
    qca7000ProcessSlice(500);
}

bool qca7000setup(spi_device_handle_t bus,
                  int csPin,
                 int rstPin,
                 int intPin,
                 int pwrPin) {
    ESP_LOGI(PLC_TAG,
             "QCA7000 setup: bus=%p CS=%d RST=%d INT=%d PWR=%d",
             bus,
             csPin,
             rstPin,
             intPin,
             pwrPin);
    head.store(0, std::memory_order_relaxed);
    tail.store(0, std::memory_order_relaxed);
    g_rx_overflow_count.store(0, std::memory_order_relaxed);
    g_spi = bus;
    g_cs = csPin;
    g_rst = rstPin;
    g_int = intPin;
    g_pwr = pwrPin;
#ifdef ESP_PLATFORM
    if (!g_spi_mutex)
        g_spi_mutex = xSemaphoreCreateMutex();
#endif
    gpio_set_direction(static_cast<gpio_num_t>(g_cs), GPIO_MODE_OUTPUT);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    if (g_pwr >= 0) {
        gpio_set_direction(static_cast<gpio_num_t>(g_pwr), GPIO_MODE_OUTPUT);
        gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
    }

    for (int attempt = 1; attempt <= static_cast<int>(slac::max_retries()); ++attempt) {
        ESP_LOGI(PLC_TAG, "Setup attempt %d", attempt);
        if (hardReset()) {
            read_region_code(&g_region);
            ESP_LOGI(PLC_TAG, "QCA7000 ready (region %u)", static_cast<unsigned>(g_region));
            return true;
        }
        if (attempt < static_cast<int>(slac::max_retries()) && g_pwr >= 0) {
            gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
            slac_delay(200);
            gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
            slac_delay(200);
        }
    }
    ESP_LOGE(PLC_TAG, "modem missing after %u setup attempts", static_cast<unsigned>(slac::max_retries()));
    return false;
}

void qca7000teardown() {
    if (g_spi) {
        // bus handle provided externally; nothing to teardown here
    }
    head.store(0, std::memory_order_relaxed);
    tail.store(0, std::memory_order_relaxed);
    g_spi = nullptr;
}

bool qca7000ResetAndCheck() {
    return hardReset();
}

bool qca7000SoftReset() {
    return softReset();
}

bool qca7000LeaveAvln() {
    // Leaving the logical network is done by issuing a soft reset which
    // clears the modem state without toggling the CP line.
    g_slac_ctx.filter_active = false;
    memset(g_slac_ctx.matched_mac, 0, sizeof(g_slac_ctx.matched_mac));
    return qca7000SoftReset();
}

void qca7000SetLinkReadyCallback(qca7000_link_ready_cb_t cb, void* arg) {
    g_link_ready_cb = cb;
    g_link_ready_arg = arg;
}

bool qca7000Sleep() {
    if (g_sleeping)
        return true;
    memcpy(g_saved_params.nmk, g_evse_nmk, sizeof(g_evse_nmk));
    memcpy(g_saved_params.mac, g_src_mac, ETH_ALEN);
    memcpy(g_saved_params.pev_id, g_slac_ctx.pev_id, sizeof(g_saved_params.pev_id));
    memcpy(g_saved_params.evse_id, g_slac_ctx.evse_id, sizeof(g_saved_params.evse_id));
    qca7000LeaveAvln();
    if (g_pwr >= 0)
        gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
    g_sleeping = true;
    if (g_link_ready_cb)
        g_link_ready_cb(false, g_link_ready_arg);
    return true;
}

bool qca7000Wake() {
    if (!g_sleeping)
        return true;
    if (g_pwr >= 0) {
        gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
        slac_delay(200);
    }
    if (!hardReset())
        return false;
    qca7000SetMac(g_saved_params.mac);
    qca7000SetIds(g_saved_params.pev_id, g_saved_params.evse_id);
    qca7000SetNmk(g_saved_params.nmk);
    g_sleeping = false;
    if (g_link_ready_cb)
        g_link_ready_cb(true, g_link_ready_arg);
    return true;
}

#ifdef ESP_PLATFORM
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>
#include <slac/channel.hpp>

void qca7000_task(void* arg) {
    auto* ctx = static_cast<Qca7000TaskContext*>(arg);
    slac::messages::HomeplugMessage msg;

    while (true) {
        qca7000Process();
        if (ctx && ctx->channel && ctx->channel->poll(msg)) {
            if (ctx->queue) {
                xQueueSend(ctx->queue, &msg, 0);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(1));
    }
}
#endif
